{
  "name": "Asatullaev Abdurakhmon",
  "logo_name": "abduraxmon",
  "role": "Back-end developer",
  "about": {
    "sections": {
      "professional-info": {
        "title": "professional-info",
        "icon": "icons/info-professional.svg",
        "info": {
          "experience": {
            "title": "experience",
            "description": "<br>I've gained valuable experience developing and maintaining backend APIs for web applications using Python frameworks like Django REST Framework. I collaborate with frontend teams to ensure API functionality aligns with user interface requirements. My experience includes utilizing PostgreSQL as the database management system, employing Git for version control, and managing project tasks with tools like Jira. Additionally, I've optimized API performance through database query optimization and caching mechanisms. Further expanding my skillset, I independently learned front-end development principles using React. This newfound knowledge allowed me to develop a new admin interface for our internal systems, improving user experience and streamlining workflows. For the FiscalBox payment system, I also integrated with various financial services and wrote clear API documentation."
          },
          "hard-skills": {
            "title": "hard-skills",
            "description": "<br>Hard-Skills<br>As a Back-end Developer, I've gained valuable experience developing and maintaining backend APIs for web applications using Python frameworks like Django REST Framework. I collaborate effectively with frontend teams to ensure API functionality aligns perfectly with user interface requirements. My expertise extends to utilizing PostgreSQL for robust database management, employing Git for efficient version control, and managing project tasks with tools like Jira. Additionally, I've consistently optimized API performance through database query optimization and caching mechanisms.<br><br>* Programming Languages (Python - DRF, JavaScript - React)<br>* Databases (PostgreSQL)<br>* Version Control (Git)<br>* Project Management (Jira)<br>* API Development<br>* Server Deployment (CentOS)<br>* API Integration (Financial Services Integration)"
          },
          "soft-skills": {
            "title": "soft-skills",
            "description": "<br>Soft-Skills<br>These hard skills are complemented by my strong soft skills, making me a valuable asset to any team. I foster strong collaboration by effectively communicating with both front-end and back-end teams, ensuring everyone is aligned on project goals and API functionality. My problem-solving skills are evident in my ability to optimize API performance and troubleshoot complex issues. Furthermore, my initiative and adaptability were demonstrated when I independently learned front-end development principles using React, allowing me to develop a new admin interface that improved user experience for our internal systems.<br><br>* Collaboration<br>* Communication<br>* Problem-Solving<br>* Initiative<br>* Adaptability"
          }
        }
      },
      "personal-info": {
        "title": "personal-info",
        "icon": "icons/info-personal.svg",
        "info": {
          "bio": {
            "title": "bio",
            "description": "<br> About me <br> I'm Abdurakhmon, and I'm an enthusiastic web developer and a responsible person, hungry for a lot of knowledge and experience, I'm genuinely passionate about using my skills to create meaningful experiences through the development of products that can truly impact people's lives. <br><br> In my spare time, you'll often find me on the football (soccer) field, either playing or watching. I'm also an avid player and watcher of online games, especially Counter-Strike, and an enthusiastic chess player, always ready to seize an opportunity for a new adventure. <br><br>Currently, I'm actively coaching friends and others who share an interest in delving into the world of web development, all while pursuing a couple of entrepreneurial ventures."
          },
          "interests": {
            "title": "interests",
            "description": "<br>In my free time, I pursue a diverse range of interests that keep me engaged and inspired. I'm an avid reader, constantly exploring new books that stimulate my imagination and expand my knowledge.<br><br>I'm also passionate about UI/UX design, where I focus on creating intuitive interfaces that prioritize user experience. Alongside this, I delve into front-end development, where I enjoy turning design concepts into interactive and functional websites."
          },
          "education": {
            "title": "education",
            "description": "<br>Education<br>I thoroughly enjoyed my time at Kimyo International University in Tashkent, where I gained a strong foundation in Information System Engineering. The collaborative environment fostered a sense of camaraderie amongst my groupmates, and I am grateful for the friendships and teamwork experiences I gained during my studies.<br><br>Skills<br>Through my academic journey, I've developed a strong foundation in various skills that are instrumental for success in my field. These include:<br>* Problem-solving<br>* Communication skills<br>* Data analysis<br>* Project management<br>* Leadership<br>* ...<br><br>Achievements<br>Here are some of my notable achievements during my academic career:<br>* prize-winner in the football tournament 2x.",
            "files": {
              "high-school": "I have been in 'Las viñas'...",
              "university": "The university..."
            }
          }
        }
      },
      "hobbies-info": {
        "title": "hobbies-info",
        "icon": "icons/info-hobbies.svg",
        "info": {
          "sports": {
            "title": "sports",
            "description": "<br>Sports<br>In my free time, I enjoy playing football (soccer) and chess. These activities have instilled in me strong teamwork and strategic thinking skills, both of which I believe are crucial for success. On the football field, I have learned the importance of communicating effectively with teammates and working together towards a common goal. Similarly, chess has honed my ability to think several steps ahead and anticipate potential challenges. As a passionate fan of Real Madrid and Manchester United, I closely follow their strategies and admire their dedication to excellence, which further fuels my own drive to achieve my best."
          },
          "favorite-games": {
            "title": "favorite-games",
            "description": "<br>Favorite-Games<br>In my leisure time, I enjoy playing online games like Counter-Strike. This has helped me develop my strategic thinking and problem-solving skills. In Counter-Strike, quick decision-making and adapting to dynamic situations are crucial for success.  These skills translate well to any fast-paced environment where analyzing information, formulating strategies, and adapting to changing circumstances are critical."
          }
        }
      }
    }
  },
  "contacts": {
    "direct": {
      "title": "contacts",
      "sources": {
        "telegram": "@Asatullayev",
        "phone": "+998998895989"
      }
    },
    "social": {
      "github": {
        "title": "Github profile",
        "url": "https://github.com/",
        "user": "Abduraxmonnn"
      },
      "linkedin": {
        "title": "LinkedIn profile",
        "url": "https://www.linkedin.com/in/abduraxmon-asatullaev-011184249",
        "user": "/"
      },
      "instagram": {
        "title": "Instagram account",
        "url": "https://instagram.com/",
        "user": "abdurakhmon.asatullayev"
      }
    },
    "find_me_also_in": {
      "title": "find-me-also-in",
      "sources": {
        "youtube": {
          "title": "YouTube channel",
          "url": "https://www.youtube.com/",
          "user": "@5hundred."
        },
        "reddit": {
          "title": "Reddit profile",
          "url": "https://www.reddit.com/user/",
          "user": "Abduraxmonn"
        },
        "instagram": {
          "title": "Instagram account",
          "url": "https://instagram.com/",
          "user": "abdurakhmon.asatullayev"
        },
        "twitch": {
          "title": "Twitter profile",
          "url": "https://x.com/",
          "user": "Abdurakhmon1803"
        }
      }
    }
  },
  "gists": {
    "1": "8d7817a7d6fc976f7597781683a6ffc3",
    "2": "d7c502f8f784edb03a9f3c8982d1fe08"
  },
  "projects": {
    "1": {
      "title": "_exam-system",
      "description": "3 steps Exam System with pdf files (also merged), Students can log-in, teachers can grade students based on their answers.",
      "img": "/images/projects/ui-animations2.png",
      "tech": [
        "Python",
        "Django"
      ],
      "url": "https://github.com/Abduraxmonnn/KIUTExamSystem"
    },
    "2": {
      "title": "_face-recognition",
      "description": "Face Detection based on trained model in KNeighborsClassifier and DecisionTreeRegressor",
      "img": "/images/projects/ai-resources.png",
      "tech": [
        "Python"
      ],
      "url": "https://github.com/Abduraxmonnn/Face-Recognition"
    },
    "3": {
      "title": "_admin-panel",
      "description": "New Admin Panel.",
      "img": "/images/projects/worldmap.png",
      "tech": [
        "JavaScript",
        "React",
        "HTML",
        "CSS"
      ],
      "url": "https://github.com/Abduraxmonnn/fbox-ui"
    },
    "4": {
      "title": "_sushi-online-shop",
      "description": "Sushi shopping web-site",
      "img": "/images/projects/ui-animations.png",
      "tech": [
        "HTML",
        "CSS"
      ],
      "url": "https://github.com/Abduraxmonnn/sushi-eat-ui"
    },
    "5": {
      "title": "_car-parking-detection",
      "description": "Car Parking Detection based on trained model related to Computer Vision.",
      "img": "/images/projects/tetris-game.png",
      "tech": [
        "Python"
      ],
      "url": "https://github.com/Abduraxmonnn/car-parking-counter"
    },
    "6": {
      "title": "_house-price-prediction",
      "description": "House Price prediction based on trained model which learn using several crucial parameters on house industry",
      "img": "/images/projects/ethereum.png",
      "tech": [
        "Python",
        "Django"
      ],
      "url": "https://github.com/Abduraxmonnn/house-price-prediction"
    }
  }
}